"""
Конфигурация проекта Telegram Search Bot
"""

# -----------------------------
# CLIP
# -----------------------------

CLIP_MODEL = "ViT-B-32"
CLIP_WEIGHTS = "laion2b_s34b_b79k"

DEVICE = "cpu"


# -----------------------------
# Поиск
# -----------------------------

# Сколько результатов возвращает пользователю
TOP_K = 10

# Сколько кандидатов брать из FAISS
SEARCH_CANDIDATES = 150

# Минимальный score
MIN_SCORE = 0.65


# -----------------------------
# Кэш
# -----------------------------

ENABLE_CACHE = True

CACHE_SIZE = 500


# -----------------------------
# Индексация
# -----------------------------

SAVE_EVERY = 100


# -----------------------------
# Логи
# -----------------------------

DEBUG = False
